## 교육시간에 작성하는 모든 코드는 나중에 공유드립니다.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df_s = pd.DataFrame(dict(v1 = [100, 200, 300], 
                         v2 = [400, 500, 600],
                         shape = ["A", "B", "C"]))

In [5]:
df_s.iloc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B

In [6]:
df_s.loc[:2, ]

    v1   v2 shape
0  100  400     A
1  200  500     B
2  300  600     C

In [7]:
df_s.v1

0    100
1    200
2    300
Name: v1, dtype: int64

In [8]:
df_s.shape

(3, 3)

In [9]:
df_s["shape"]

0    A
1    B
2    C
Name: shape, dtype: object

In [10]:
df_s.iloc[:, :-1]

    v1   v2
0  100  400
1  200  500
2  300  600

In [11]:
df_s.loc[:, "v2":]

    v2 shape
0  400     A
1  500     B
2  600     C

In [15]:
df_s.loc[df_s["v1"] == 200, ]

    v1   v2 shape
1  200  500     B

In [16]:
df_s.loc[df_s["v1"] != 200, ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [20]:
df_s["v1"] == 200

0    False
1     True
2    False
Name: v1, dtype: bool

In [21]:
~(df_s["v1"] == 200)

0     True
1    False
2     True
Name: v1, dtype: bool

In [22]:
df_s.loc[~(df_s["v1"] == 200), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [23]:
df_s.loc[(df_s["v1"] == 200) & (df_s["v2"] == 600), ]

Empty DataFrame
Columns: [v1, v2, shape]
Index: []

In [24]:
df_s.loc[(df_s["v1"] == 200) | (df_s["v2"] == 600), ]

    v1   v2 shape
1  200  500     B
2  300  600     C

In [ ]:
condi_1 = df_s["v1"] == 200
condi_2 = df_s["v2"] == 500
df_s.loc[condi_1 & condi_2, ]

In [27]:
df_s.loc[(df_s["shape"] == "A") | (df_s["shape"] == "C"), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [26]:
df_s.loc[df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
0  100  400     A
2  300  600     C

In [28]:
df_s.loc[~df_s["shape"].isin(["A", "C"]), ]

    v1   v2 shape
1  200  500     B

In [29]:
df_s.columns

Index(['v1', 'v2', 'shape'], dtype='object')

In [ ]:
df = pd.read_csv("krx_202105_utf8.csv")
df.head(2)

In [ ]:
df_sub = df.loc[df["지수명"] == "KRX 300", ]
df_sub

In [38]:
df.loc[df["종가"] == df["종가"].max(), ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

In [39]:
df["종가"].idxmax()

117

In [40]:
df.loc[df["종가"].idxmax(), ["지수명", "종가", "날짜"]]

지수명     KTOP 30
종가     11869.29
날짜     20210510
Name: 117, dtype: object

In [41]:
df.loc[[df["종가"].idxmax()], ["지수명", "종가", "날짜"]]

         지수명        종가        날짜
117  KTOP 30  11869.29  20210510

* 결측치: https://datadoctorblog.com/2023/04/24/Py-Basic-Pandas-Missing/

In [44]:
df = pd.read_csv("iris_missing.csv")
df_sub = df.head()
df_sub

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [46]:
# df_sub.info()

In [48]:
df_sub.count()

Sepal.Length    5
Sepal.Width     4
Petal.Length    4
Petal.Width     5
Species         5
dtype: int64

In [49]:
df_sub.dtypes

Sepal.Length    float64
Sepal.Width     float64
Petal.Length    float64
Petal.Width     float64
Species          object
dtype: object

In [50]:
df_sub.isna().sum() # ⭐⭐⭐

Sepal.Length    0
Sepal.Width     1
Petal.Length    1
Petal.Width     0
Species         0
dtype: int64

In [51]:
df_sub.isna()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width  Species
0         False         True          True        False    False
1         False        False         False        False    False
2         False        False         False        False    False
3         False        False         False        False    False
4         False        False         False        False    False

In [ ]:
df_sub.isna().sum(axis = 1)

In [ ]:
df_sub.apply(lambda x: x.isna().sum(), axis = 1)

In [56]:
df_sub1 = df_sub.loc[df_sub["Sepal.Width"].isna(), ]
df_sub1

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          NaN           NaN          0.2  setosa

In [ ]:
df_sub2 = df_sub.loc[df_sub["Sepal.Width"].notna(), ]
df_sub2

In [ ]:
df_sub3 = df_sub.dropna()
df_sub3

In [ ]:
df_sub.loc[:, "Sepal.Width"] = df_sub.loc[:, "Sepal.Width"].fillna(-999)
df_sub["Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
# df_sub.loc[:, "Petal.Length"] = df_sub["Petal.Length"].fillna(df_sub["Petal.Length"].mean())
df_sub

In [65]:
# df_sub2 = df.head().copy()
df_sub2 = df.head().reset_index(drop = True)

In [ ]:
df_sub2.loc[:, "Sepal.Width"] = df_sub2.loc[:, "Sepal.Width"].fillna(-999)
df_sub2["Petal.Length"] = df_sub2["Petal.Length"].fillna(df_sub2["Petal.Length"].mean())
df_sub2

In [ ]:
df.tail().reset_index(drop = True)

In [ ]:
df.tail().reset_index()

In [70]:
df.tail().set_index("Species").reset_index() # 특정 변수의 기존 위치에 관계없이 가장 앞으로 옮김

     Species  Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0  virginica           6.7          3.0           5.2          2.3
1  virginica           NaN          2.5           NaN          NaN
2  virginica           6.5          3.0           5.2          2.0
3  virginica           6.2          3.4           5.4          2.3
4  virginica           5.9          3.0           5.1          NaN

In [ ]:
df_sub2.loc[:, df_sub2.dtypes == "object"]

In [ ]:
df_sub2.loc[:, df_sub2.dtypes != "object"]

* 정렬: https://datadoctorblog.com/2023/04/25/Py-Basic-Pandas-Sorting/
* 원소/조합 세기: https://datadoctorblog.com/2023/04/04/Py-Basic-Pandas-Counting/

In [ ]:
df = pd.read_csv("bike.csv")
df.head(2)

In [84]:
df["season"].unique()

array([1, 2, 3, 4])

In [ ]:
df["season"].nunique()

In [86]:
df["season"].drop_duplicates()

0       1
1323    2
2690    3
4055    4
Name: season, dtype: int64

In [88]:
# df.iloc[1321:1325, ]

In [ ]:
df["season"].value_counts()

In [90]:
df["season"].value_counts().sort_index()

season
1    2686
2    2733
3    2733
4    2734
Name: count, dtype: int64

In [91]:
df["season"].value_counts(normalize = True)

season
4    0.251148
2    0.251056
3    0.251056
1    0.246739
Name: proportion, dtype: float64

In [ ]:
df[["season", "holiday"]].drop_duplicates() # 중복 행 제거

In [ ]:
pd.crosstab(df["season"], df["holiday"])

In [ ]:
pd.crosstab(df["season"], df["holiday"]).reset_index().melt(id_vars = "season",
                                                            var_name = "holiday")

* crosstab(): https://datadoctorblog.com/2023/05/06/Py-Basic-Pandas-Crosstab/
* .groupby(): https://datadoctorblog.com/2023/04/28/Py-Basic-Pandas-Groupby/

In [ ]:
df = pd.read_csv("diamonds.csv")
df.head(2)

In [102]:
df.groupby("cut")["carat"].max()

cut
Fair         5.01
Good         3.01
Ideal        3.50
Premium      4.01
Very Good    4.00
Name: carat, dtype: float64

In [ ]:
df_g1 = df.groupby("cut")["carat"].max().reset_index()
df_g1

In [ ]:
df.groupby("cut")[["carat", "price"]].max()

In [ ]:
df_g2 = df.groupby("cut")[["carat", "price"]].max().reset_index()
df_g2

In [ ]:
df_g3 = df.groupby(["cut", "color"])["price"].max().reset_index()
df_g3.head()

In [ ]:
df.groupby("cut")["carat"].agg(["min", "max"])

In [108]:
df.groupby("cut")[["carat", "price"]].agg({"carat": "max", "price": "min"}) # 🎯🎯 시험 기출 유형

           carat  price
cut
Fair        5.01    337
Good        3.01    327
Ideal       3.50    326
Premium     4.01    326
Very Good   4.00    336

* 문자데이터: https://datadoctorblog.com/2023/04/20/Py-Basic-Pandas-String-Data/

In [ ]:
df_tx = pd.DataFrame(dict(v1 = [100, 200, 300],
                          v2 = ["abc", "aaa", "ccc"],
                          v3 = [123, "1234-5678", "010-1234-5678"]))
df_tx

In [ ]:
df_tx["v2"].replace("a", "🔥")

In [ ]:
df_tx["v2"].replace("aaa", "🔥")

In [ ]:
df_tx["v2"].replace({"aaa": "🔥", "ccc": "🩵"})

In [ ]:
df_tx["v2"].str.replace("a", "🔥")

In [ ]:
df_tx["v2"].str.replace("aaa", "🔥")

In [ ]:
df_tx["v2"].str.contains("a")

In [ ]:
~df_tx["v2"].str.contains("a")

In [ ]:
df_tx.loc[df_tx["v2"].str.contains("a"), ]

In [ ]:
df_tx.loc[~df_tx["v2"].str.contains("a"), ]

In [122]:
df_tx["v3"].str.split("-")

0                  NaN
1         [1234, 5678]
2    [010, 1234, 5678]
Name: v3, dtype: object

In [123]:
df_tx["v4"] = df_tx["v3"].astype("str")
df_tx["v4"]

0              123
1        1234-5678
2    010-1234-5678
Name: v4, dtype: object

In [126]:
df_tx["v4"][0]

'123'

In [ ]:
df_tx["v4"].str.split("-")

In [ ]:
df_tx["v4"].str.split("-").explode()

In [129]:
df_tx_v4 = df_tx["v4"].str.split("-", expand = True)
df_tx_v4

      0     1     2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [130]:
df_tx_v4_2 = df_tx_v4.add_prefix("v4_")
df_tx_v4_2

   v4_0  v4_1  v4_2
0   123  None  None
1  1234  5678  None
2   010  1234  5678

In [131]:
df_tx_v4_3 = df_tx_v4_2.fillna("🥗")
df_tx_v4_3

   v4_0  v4_1  v4_2
0   123     🥗     🥗
1  1234  5678     🥗
2   010  1234  5678

* 시간데이터: https://datadoctorblog.com/2023/04/14/Py-Basic-Pandas-Time-Data/

In [138]:
ser_t1 = pd.Series(["2077-12-18", "2077-12-19", "2077-12-20"])
ser_t2 = pd.Series(["2077년 12월 18일", "2077년 12월 19일", "2077년 12월 20일"])
ser_t3 = pd.Series([20241218, 20241219, 20241220])
ser_t4 = pd.Series([1234, 2345, 3456])

In [134]:
pd.to_datetime(ser_t1)

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [ ]:
pd.to_datetime(ser_t2) # 에러

https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [136]:
pd.to_datetime(ser_t2, format = "%Y년 %m월 %d일")

0   2077-12-18
1   2077-12-19
2   2077-12-20
dtype: datetime64[ns]

In [139]:
pd.to_datetime(ser_t3)

0   1970-01-01 00:00:00.020241218
1   1970-01-01 00:00:00.020241219
2   1970-01-01 00:00:00.020241220
dtype: datetime64[ns]

In [140]:
pd.to_datetime(ser_t3.astype("str"))

0   2024-12-18
1   2024-12-19
2   2024-12-20
dtype: datetime64[ns]

In [142]:
pd.to_datetime(ser_t4)

0   1970-01-01 00:00:00.000001234
1   1970-01-01 00:00:00.000002345
2   1970-01-01 00:00:00.000003456
dtype: datetime64[ns]

In [143]:
pd.to_datetime(ser_t4, origin = "2070-01-01", unit = "m")

0   2070-01-01 20:34:00
1   2070-01-02 15:05:00
2   2070-01-03 09:36:00
dtype: datetime64[ns]

In [149]:
df_bike = pd.read_csv("bike.csv")
df_dt2 = df_bike[["datetime"]].copy() # 데이터프레임 유형 유지를 위해 대괄호 2개

In [151]:
df_dt2["datetime"] = pd.to_datetime(df_dt2["datetime"])
df_dt2["date"] = df_dt2["datetime"].dt.date
df_dt2["yyyymm"] = df_dt2["datetime"].dt.strftime("%Y-%m")
df_dt2["year"  ] = df_dt2["datetime"].dt.year
df_dt2["month" ] = df_dt2["datetime"].dt.month
df_dt2["wday"  ] = df_dt2["datetime"].dt.weekday
df_dt2["wend"  ] = np.where(df_dt2["wday"] >= 5, 1, 0)
df_dt2["hour"  ] = df_dt2["datetime"].dt.hour
df_dt2["dt_s9h"] = df_dt2["datetime"] + pd.to_timedelta(9, unit = "h")

In [152]:
df_dt2.head(2)

,datetime,date,yyyymm,year,month,wday,wend,hour,dt_s9h
0,2011-01-01 00:00:00,2011-01-01,2011-01,2011,1,5,1,0,2011-01-01 09:00:00
1,2011-01-01 01:00:00,2011-01-01,2011-01,2011,1,5,1,1,2011-01-01 10:00:00

In [ ]:
df_dt2.dtypes

In [154]:
df_dt = pd.DataFrame(dict(date = ["2077-08-01", "2077-08-02", "2077-08-03"]))
df_dt["origin"] = "2077-01-01"
df_dt["date"  ] = pd.to_datetime(df_dt["date"])
df_dt["origin"] = pd.to_datetime(df_dt["origin"])
df_dt["diff"  ] = df_dt["date"] - df_dt["origin"]
df_dt["diff_d"] = df_dt["diff"].dt.days
df_dt

        date     origin     diff  diff_d
0 2077-08-01 2077-01-01 212 days     212
1 2077-08-02 2077-01-01 213 days     213
2 2077-08-03 2077-01-01 214 days     214

In [155]:
df_dt.dtypes

date       datetime64[ns]
origin     datetime64[ns]
diff      timedelta64[ns]
diff_d              int64
dtype: object

In [ ]:
df_t = pd.DataFrame(dict(date = pd.date_range("2024-01-01", "2024-01-07"),
                         v = [100, 200, 300, np.nan, 500, 600, 700]))
df_t

In [160]:
df_t["v_s1"] = df_t["v"].shift(1)
df_t["v_s2"] = df_t["v"].shift(2)
df_t["v_sn1"] = df_t["v"].shift(-1)
df_t["v_fill_1"] = np.where(df_t["v"].isna(),
                            (df_t["v_s1"] + df_t["v_sn1"]) / 2,
                            df_t["v"])
df_t["v_fill_2"] = df_t["v"].interpolate()

In [161]:
df_t

        date      v   v_s1   v_s2  v_sn1  v_fill_1  v_fill_2
0 2024-01-01  100.0    NaN    NaN  200.0     100.0     100.0
1 2024-01-02  200.0  100.0    NaN  300.0     200.0     200.0
2 2024-01-03  300.0  200.0  100.0    NaN     300.0     300.0
3 2024-01-04    NaN  300.0  200.0  500.0     400.0     400.0
4 2024-01-05  500.0    NaN  300.0  600.0     500.0     500.0
5 2024-01-06  600.0  500.0    NaN  700.0     600.0     600.0
6 2024-01-07  700.0  600.0  500.0    NaN     700.0     700.0

* .melt(): https://datadoctorblog.com/2023/05/07/Py-Basic-Pandas-Melt/
* pivoting: https://datadoctorblog.com/2023/05/10/Py-Basic-Pandas-Pivoting/

In [165]:
df_e = pd.read_csv("elec_load_2017_7d.csv")
df_e.head(1)

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2017,1,1,60178,57862,56165,55135,54450,54401,54147,...,49213,49357,50362,53115,55205,55437,55348,55790,58195,59330

In [166]:
df_e_m1 = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"])
df_e_m1.head()

   YEAR  MONTH  DAY variable  value
0  2017      1    1     X1HR  60178
1  2017      1    2     X1HR  57067
2  2017      1    3     X1HR  66263
3  2017      1    4     X1HR  68403
4  2017      1    5     X1HR  68053

In [ ]:
df_e_m2 = df_e.melt(id_vars = ["YEAR", "MONTH", "DAY"], var_name = "HOUR", value_name = "LOAD")
df_e_m2.head()

In [168]:
df_e_m2["h1"] = df_e_m2["HOUR"].str.replace("X", "").str.replace("HR", "")
df_e_m2["h2"] = df_e_m2["HOUR"].str.replace("X|HR", "", regex = True) # regex: regular expression(정규표현식)
df_e_m2["h3"] = df_e_m2["HOUR"].str.replace("[A-Z]", "", regex = True) # 영문 대문자
df_e_m2["h4"] = df_e_m2["HOUR"].str.replace("[^0-9]", "", regex = True) # 숫자를 제외한 나머지 모든 것

In [ ]:
df_e_m2.dtypes

In [ ]:
df_e_m2.tail()

In [172]:
df = pd.read_csv("diamonds.csv")

In [173]:
df.head(2)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [ ]:
df.groupby(["cut", "color"])["price"].mean()

In [178]:
pd.crosstab(index = df["cut"], columns = df["color"], values = df["price"], aggfunc = "mean")

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,4291.061350,3682.312500,3827.003205,4239.254777,5135.683168,4685.445714,4975.655462
Good,3405.382175,3423.644159,3495.750275,4123.482204,4276.254986,5078.532567,4574.172638
Ideal,2629.094566,2597.550090,3374.939362,3720.706388,3889.334831,4451.970377,4918.186384
Premium,3631.292576,3538.914420,4324.890176,4500.742134,5216.706780,5946.180672,6294.591584
Very Good,3470.467284,3214.652083,3778.820240,3872.753806,4535.390351,5255.879568,5103.513274

In [179]:
df.pivot_table(index = "cut", columns = "color", values = "price", aggfunc = "mean")

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,4291.061350,3682.312500,3827.003205,4239.254777,5135.683168,4685.445714,4975.655462
Good,3405.382175,3423.644159,3495.750275,4123.482204,4276.254986,5078.532567,4574.172638
Ideal,2629.094566,2597.550090,3374.939362,3720.706388,3889.334831,4451.970377,4918.186384
Premium,3631.292576,3538.914420,4324.890176,4500.742134,5216.706780,5946.180672,6294.591584
Very Good,3470.467284,3214.652083,3778.820240,3872.753806,4535.390351,5255.879568,5103.513274

In [180]:
df.pivot_table(index = "cut", columns = "color", values = "price", aggfunc = "mean").round(2)

color            D        E        F        G        H        I        J
cut
Fair       4291.06  3682.31  3827.00  4239.25  5135.68  4685.45  4975.66
Good       3405.38  3423.64  3495.75  4123.48  4276.25  5078.53  4574.17
Ideal      2629.09  2597.55  3374.94  3720.71  3889.33  4451.97  4918.19
Premium    3631.29  3538.91  4324.89  4500.74  5216.71  5946.18  6294.59
Very Good  3470.47  3214.65  3778.82  3872.75  4535.39  5255.88  5103.51

In [ ]:
df.pivot_table(index = "cut", columns = "color", values = "price",
               aggfunc = lambda x: round(x.mean(), 2))

* merge: https://datadoctorblog.com/2023/05/22/Py-Basic-Pandas-Merge/

In [182]:
df_bike = pd.read_csv("bike.csv")

In [184]:
df_b1 = df_bike.iloc[:4, 4:7]
df_b2 = df_bike.iloc[1:5, 5:8]

In [ ]:
pd.concat([df_b1, df_b2])

In [ ]:
pd.concat([df_b1, df_b2], axis = 1)

In [189]:
pd.concat([df_b1, df_b2.reset_index(drop = True).add_suffix("_y")], axis = 1)

   weather  temp   atemp  temp_y  atemp_y  humidity_y
0        1  9.84  14.395    9.02   13.635          80
1        1  9.02  13.635    9.02   13.635          80
2        1  9.02  13.635    9.84   14.395          75
3        1  9.84  14.395    9.84   14.395          75

In [ ]:
df_b1_2 = df_b1.reset_index()
df_b2_2 = df_b2.reset_index()
df_b1_2

In [193]:
df_join1 = pd.merge(df_b1_2, df_b1_2, on = "index", how = "inner")
df_join1

   index  weather_x  temp_x  atemp_x  weather_y  temp_y  atemp_y
0      0          1    9.84   14.395          1    9.84   14.395
1      1          1    9.02   13.635          1    9.02   13.635
2      2          1    9.02   13.635          1    9.02   13.635
3      3          1    9.84   14.395          1    9.84   14.395